while True:
    a = input('введите целое число от 1 до 999')
    if int(a) in range(0,999):
        break
    else:
      print("введите корректно")

numbers = ["", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
ten = ["десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать",
             "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят",
            "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот",
                "семьсот", "восемьсот", "девятьсот"]
h = int(a)//100
t = (int(a) % 100)//10
n = int(a)%10
itog=''
if h>0:
  itog += hundreds[h] + ' '
if t>1:
  itog += tens[t] + ' '
  if n>0:
    itog += numbers[n] + ' '
elif t==1:
  itog += ten[t] + ' '
else:
  itog += numbers[n] + ' '
print(itog)